{
  "id": "boss_human_t4_03",
  "name": "War General",
  "sourceCategory": "bosses",
  "sourceFile": "human",
  "sprite": "human_t4_03",
  "status": "pending",
  "files": {
    "original": "images/bosses/boss_human_t4_03_original.png"
  },
  "tier": 4,
  "biome": "badlands",
  "stats": {
    "health": 350,
    "damage": 30,
    "speed": 60,
    "defense": 0
  },
  "combat": {
    "attackRange": 130,
    "attackRate": 1.0,
    "aggroRange": 300,
    "packAggro": false,
    "attackType": "melee"
  },
  "sfx": {
    "spawn": "sfx_spawn_human_t4_03",
    "death": "sfx_death_human_t4_03",
    "hurt": "sfx_hurt_human_t4_03",
    "aggro": "sfx_aggro_human_t4_03"
  },
  "spawning": {
    "biomes": [
      "badlands"
    ],
    "groupSize": [
      1,
      2
    ],
    "weight": 50,
    "respawnTime": 30
  },
  "loot": [
    {
      "item": "salvage_t3_01",
      "chance": 1.0,
      "amount": [
        2,
        4
      ]
    },
    {
      "item": "mechanical_t3_01",
      "chance": 0.6,
      "amount": [
        1,
        2
      ]
    },
    {
      "item": "kriegsmesser",
      "chance": 0.15,
      "amount": [
        1,
        1
      ]
    }
  ],
  "xpReward": 180,
  "isBoss": true,
  "sourceDescription": "male commander, muscle build, charred black uniform with red trim, massive pauldrons, iron death mask, longsword",
  "weaponType": "longsword",
  "role": "special",
  "description": "The War General's helmet rises like a crown of iron, the welded mask below bearing campaign markings from more wars than most soldiers know exist. Those eyes behind the mask have commanded armies, shaped doctrine, and buried more enemies than the volcanic ash they stand upon. The mask's stern expression reflects proven lethality.\n\nFull plate armor marks this as the heaviest commander role - layered iron plates that could shrug off close-range fire, worn without apparent effort. A charcoal grey cape flows from shoulder guards broad as fortification merlons. Decorations and campaign honors cover every available surface, each earned through victory.\n\nIron boots have led charges that broke enemy formations across these badlands. A longsword - chosen over modern weapons - speaks to a commander who believes in demonstrating personal courage. The War General has earned every rank through proved devastating effectiveness in the worst conditions warfare offers.",
  "bodyType": "medium",
  "declineNote": ""
}