{
  "id": "boss_dinosaur_t2_02",
  "name": "Pack Alpha",
  "sourceCategory": "bosses",
  "sourceFile": "dinosaur",
  "sprite": "dinosaur_t2_02",
  "status": "pending",
  "files": {
    "original": "images/bosses/boss_dinosaur_t2_02_original.png"
  },
  "tier": 2,
  "biome": "tundra",
  "stats": {
    "health": 200,
    "damage": 18,
    "speed": 95,
    "defense": 0
  },
  "combat": {
    "attackRange": 120,
    "attackRate": 1.5,
    "aggroRange": 300,
    "packAggro": true,
    "attackType": "melee"
  },
  "sfx": {
    "spawn": "sfx_spawn_dinosaur_t2_02",
    "death": "sfx_death_dinosaur_t2_02",
    "hurt": "sfx_hurt_dinosaur_t2_02",
    "aggro": "sfx_aggro_dinosaur_t2_02"
  },
  "spawning": {
    "biomes": [
      "tundra"
    ],
    "groupSize": [
      1,
      2
    ],
    "weight": 50,
    "respawnTime": 30
  },
  "loot": [
    {
      "item": "leather_t1_01",
      "chance": 1.0,
      "amount": [
        3,
        5
      ]
    },
    {
      "item": "leather_t1_01",
      "chance": 1.0,
      "amount": [
        2,
        3
      ]
    },
    {
      "item": "cavalry_sabre",
      "chance": 0.5,
      "amount": [
        1,
        1
      ]
    }
  ],
  "xpReward": 80,
  "isBoss": true,
  "sourceDescription": "Utahraptor, white and grey, fur-trimmed coloring, ornate barding with painted war markings, heavily muscled, old wounds visible",
  "species": "Utahraptor",
  "description": "The Pack Alpha represents the pinnacle of Utahraptor evolution - larger, smarter, more vicious than any of its pack. This creature leads through demonstrated superiority, regularly killing challengers to reinforce hierarchy. Its feathered crest is decorated with the remains of previous rivals.\n\nBronze-reinforced leather barding covers a lithe muscular frame, the armor battered but functional from countless engagements. White-grey and pale brown coloring provides winter camouflage, though the creature's confidence means it rarely relies on stealth. Silver buckles gleam against frost-covered straps.\n\nThe killing claws on those digitigrade feet are legendary among tundra soldiers - each curved blade longer than a cavalryman's knife. The Pack Alpha coordinates attacks across its hunting territory, appearing to anticipate military movements before they occur. This creature hunts with strategy, not just instinct."
}