{
  "id": "boss_saurian_t3_02",
  "name": "Sand Crusher",
  "sourceCategory": "bosses",
  "sourceFile": "saurian",
  "sprite": "saurian_t3_02",
  "status": "pending",
  "tier": 3,
  "biome": "desert",
  "stats": {
    "health": 150,
    "damage": 20,
    "speed": 75,
    "defense": 0
  },
  "combat": {
    "attackRange": 100,
    "attackRate": 1.5,
    "aggroRange": 280,
    "packAggro": true,
    "attackType": "melee"
  },
  "sfx": {
    "spawn": "sfx_spawn_saurian_t3_02",
    "death": "sfx_death_saurian_t3_02",
    "hurt": "sfx_hurt_saurian_t3_02",
    "aggro": "sfx_aggro_saurian_t3_02"
  },
  "spawning": {
    "biomes": [
      "desert"
    ],
    "groupSize": [
      1,
      1
    ],
    "weight": 25,
    "respawnTime": 60
  },
  "loot": [
    {
      "item": "minerals_t3_01",
      "chance": 1.0,
      "amount": [
        2,
        4
      ]
    },
    {
      "item": "leather_t3_01",
      "chance": 0.8,
      "amount": [
        1,
        2
      ]
    }
  ],
  "xpReward": 90,
  "isBoss": true,
  "species": "Pachycephalosaurus",
  "sourceDescription": "anthropomorphic Pachycephalosaurus, bronze uniform, reinforced steel plate, barbuta helmet, war hammer",
  "weaponType": "war_hammer",
  "role": "heavy",
  "description": "The Sand Crusher presents that signature domed skull with aggressive intent, the bone thickened through a lifetime of devastating headbutt attacks. This Pachycephalosaurus saurian has risen to command through demonstrated superiority in the most direct possible way. Those small eyes hold single-minded determination.\n\nBronze commander armor allows full mobility for charging attacks while providing status markers appropriate to rank. Sun-bleached leather straps secure the minimal protection, prioritizing the creature's natural weapon over defensive capability. A decorated cape flows backward during charges, adding to the spectacle.\n\nHeavy digitigrade legs coil with explosive power, the exposed clawed feet gripping sand for maximum acceleration. A war hammer provides backup for when the skull-ram fails to end combat, though that happens rarely. The Sand Crusher has never lost a challenge battle - survival demands more cunning opponents avoid direct confrontation.",
  "files": {
    "original": "images/bosses/boss_saurian_t3_02_original.png"
  },
  "declineNote": ""
}