{
  "id": "boss_saurian_t2_02",
  "name": "Ice Stalker",
  "sourceCategory": "bosses",
  "sourceFile": "saurian",
  "sprite": "saurian_t2_02",
  "status": "pending",
  "tier": 2,
  "biome": "tundra",
  "stats": {
    "health": 140,
    "damage": 15,
    "speed": 85,
    "defense": 0
  },
  "combat": {
    "attackRange": 100,
    "attackRate": 1.5,
    "aggroRange": 280,
    "packAggro": true,
    "attackType": "melee"
  },
  "sfx": {
    "spawn": "sfx_spawn_saurian_t2_02",
    "death": "sfx_death_saurian_t2_02",
    "hurt": "sfx_hurt_saurian_t2_02",
    "aggro": "sfx_aggro_saurian_t2_02"
  },
  "spawning": {
    "biomes": [
      "tundra"
    ],
    "groupSize": [
      1,
      1
    ],
    "weight": 25,
    "respawnTime": 60
  },
  "loot": [
    {
      "item": "minerals_t2_01",
      "chance": 1.0,
      "amount": [
        2,
        4
      ]
    },
    {
      "item": "leather_t2_01",
      "chance": 0.8,
      "amount": [
        1,
        2
      ]
    }
  ],
  "xpReward": 60,
  "isBoss": true,
  "species": "Baryonyx",
  "sourceDescription": "anthropomorphic Baryonyx, grey fur-trimmed coat, rank insignia badges, iron mask, knife",
  "weaponType": "knife",
  "role": "medium",
  "description": "The Ice Stalker's Baryonyx crocodilian snout emerges from darkness and storm with patient menace, those cold eyes ancient as frozen tundra. This ambush predator has learned to use military tactics to enhance natural hunting behavior. The long jaws remain closed through discipline, but rows of conical teeth gleam with promised violence.\n\nPale armor covers the elongated body, silver-trimmed plates fitted for the creature's unusual proportions. Fur-lined pale leather straps disappear beneath overlapping protection designed for tundra conditions. A commander's cloak covers the creature's back, disguising its true size until too late.\n\nMassive clawed forelimbs are fitted with iron blade extensions, augmenting natural weapons with military engineering. Those heavy legs move with impossible silence through frozen terrain. The Ice Stalker has perfected the ambush - targets vanish without alarm, discovered only when search parties find the remains.",
  "files": {
    "original": "images/bosses/boss_saurian_t2_02_original.png"
  }
}