{
  "id": "enemy_herbivore_t4_01",
  "name": "Titan",
  "sourceCategory": "enemies",
  "sourceFile": "herbivore",
  "sprite": "herbivore_t4_01",
  "status": "pending",
  "tier": 4,
  "biome": "badlands",
  "stats": {
    "health": 250,
    "damage": 18,
    "speed": 40,
    "defense": 0
  },
  "combat": {
    "attackRange": 100,
    "attackRate": 1.5,
    "aggroRange": 250,
    "packAggro": false,
    "attackType": "melee"
  },
  "sfx": {
    "spawn": "sfx_spawn_herbivore_t4_01",
    "death": "sfx_death_herbivore_t4_01",
    "hurt": "sfx_hurt_herbivore_t4_01",
    "aggro": "sfx_aggro_herbivore_t4_01"
  },
  "spawning": {
    "biomes": [
      "badlands"
    ],
    "groupSize": [
      1,
      2
    ],
    "weight": 50,
    "respawnTime": 30
  },
  "loot": [
    {
      "item": "minerals_t4_01",
      "chance": 0.7,
      "amount": [
        1,
        2
      ]
    },
    {
      "item": "salvage_t4_01",
      "chance": 0.3,
      "amount": [
        1,
        1
      ]
    }
  ],
  "xpReward": 60,
  "species": "Argentinosaurus",
  "sourceDescription": "Argentinosaurus, volcanic grey and dark brown, massive long-necked sauropod",
  "description": "The Titan lives up to its name - an Argentinosaurus of unimaginable scale, each footfall sending tremors through the volcanic soil. Its impossibly long neck rises from shoulders broad as barracks buildings, head disappearing into badlands smog. The eyes are patient, ancient, seeing threats as temporary inconveniences.\n\nDark mottled grey hide covers its mountainous body, volcanic ash settling into wrinkles and folds to complete its camouflage. Black patches along its back and flanks help it blend with basalt formations. Its skin is inches thick, natural armor that shrugs off most weapons without conscious attention.\n\nLegs like pillars of living granite support incalculable tonnage, each step irreversible once begun. The whip-like tail can shatter structures and crush vehicles with casual sweeps. This creature fears nothing because nothing can threaten it - only time and disease concern something that measures lifespan in centuries.",
  "files": {
    "original": "images/enemies/herbivore_t4_01_original.png"
  },
  "weaponType": "horns"
}