{
  "id": "enemy_human_t4_03",
  "name": "War Veteran",
  "sourceCategory": "enemies",
  "sourceFile": "human",
  "sprite": "human_t4_03",
  "status": "pending",
  "tier": 4,
  "biome": "badlands",
  "stats": {
    "health": 180,
    "damage": 15,
    "speed": 55,
    "defense": 0
  },
  "combat": {
    "attackRange": 400,
    "attackRate": 1.5,
    "aggroRange": 250,
    "packAggro": false,
    "attackType": "ranged"
  },
  "sfx": {
    "spawn": "sfx_spawn_human_t4_03",
    "death": "sfx_death_human_t4_03",
    "hurt": "sfx_hurt_human_t4_03",
    "aggro": "sfx_aggro_human_t4_03"
  },
  "spawning": {
    "biomes": [
      "badlands"
    ],
    "groupSize": [
      1,
      2
    ],
    "weight": 50,
    "respawnTime": 30
  },
  "loot": [
    {
      "item": "minerals_t4_01",
      "chance": 0.7,
      "amount": [
        1,
        2
      ]
    },
    {
      "item": "salvage_t4_01",
      "chance": 0.3,
      "amount": [
        1,
        1
      ]
    }
  ],
  "xpReward": 60,
  "gender": "male",
  "bodyType": "fat",
  "sourceDescription": "male soldier, fat build, charred brown greatcoat, plate armor, skull visor, shotgun",
  "weaponType": "shotgun",
  "role": "special",
  "description": "The War Veteran's helmet conceals a face that has seen every horror warfare offers - the iron mask welded shut, never to be removed. Whatever visage remains beneath is the soldier's secret alone. Only the weary set of the shoulders reveals the weight of countless campaigns behind that armor.\n\nThis male soldier's broad, heavy-set build is covered in ornate commander armor - gilded iron plates worn smooth by years of use rather than polished for parade. A charcoal grey cape hangs from his shoulders, edges burnt and torn but never replaced. Multiple campaign medals line the chest, most from wars younger soldiers have only read about.\n\nHeavy boots have marched across every terrain the world offers, the soles replaced countless times on the same trusted frames. A trench shotgun serves as his weapon of choice - devastating at close range, requiring minimal ammunition in extended deployments. This elite specialist has nothing left to prove, only a job to complete.",
  "files": {
    "original": "images/enemies/human_t4_03_original.png"
  },
  "species": "Commander"
}